_posts/2018-05-17-Literate-programming-with-python-doctests.html
---
title: Literate programming with python doctests
date: 2018/05/17 16:41:19
updated: 2018/05/18 15:07:13
categories: python,noweb,orgmode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org91f890f">1. Add a way to run the tests</a></li>
<li><a href="#org4759a84">2. Tangle the file</a></li>
<li><a href="#org8727607">3. Run the tests</a></li>
<li><a href="#org5a82a2f">4. The noweb doctest block</a></li>
</ul>
</div>
</div>
<p>
On the org-mode mailing list we had a nice discussion about using noweb and org-mode in literate programming. The results of that discussion were blogged about <a href="http://kdr2.com/tech/emacs/1805-approach-org-ref-code-to-text.html">here</a>. I thought of a different application of this for making <a href="https://pymotw.com/3/doctest/">doctests</a> in Python functions. I have to confess I have never liked these because I have always thought they were a pain to write since you basically have to put code and results into a docstring. The ideas developed in the discussion above led me to think of a new way to write these that seems totally reasonable.
</p>

<p>
The idea is just to put noweb placeholders in the function docstring for the doctests. The placeholders will be expanded when you tangle the file, and they will get their contents from other src-blocks where you have written and run examples to test them.
</p>

<p>
This video might make the rest of this post easier to follow:
</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/u8CWbedVV9Y" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>

<p>
I will illustrate the idea using org-mode and the ob-ipython I have in scimax. The defaults of my ob-ipython setup are not useful for this example because it puts the execution count and mime types of output in the output. These are not observed in a REPL, and so we turn this off by setting these variables.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">setq</span> ob-ipython-suppress-execution-count t
      ob-ipython-show-mime-types nil)
</pre>
</div>

<p>
Now, we make an example function that takes a single argument and returns one divided by that argument. This block is runnable, and the function is then defined in the jupyter kernel. The docstring contains several noweb references to doctest blocks we define later. For now, they don't do anything. See <a href="#org5a82a2f">The noweb doctest block</a> section for the block that is used to expand these. This block also has a tangle header which indicates the file to tangle the results to. When I run this block, it is sent to a Jupyter kernel and saved in memory for use in subsequent blocks.
</p>

<p>
Here is the block with no noweb expansion. Note that this is easier to read in the original org source than it is to read in the published blog format.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">def</span> <span style="color: #006699;">func</span>(a):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #036A07;">"""A function to divide one by a.</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   &lt;&lt;doctest("doctest-1")&gt;&gt;</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   &lt;&lt;doctest("doctest-2")&gt;&gt;</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   &lt;&lt;doctest("doctest-3")&gt;&gt;</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   Returns: 1 / a.</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   """</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> 1 / a

</pre>
</div>

<p>
Now, we can write a series of named blocks that define various tests we might want to use as doctests. You can run these blocks here, and verify they are correct. Later, when we tangle the document, these will be incorporated into the tangled file in the docstring we defined above.
</p>

<div class="org-src-container">
<pre class="src src-ipython" id="org4eaeeaf">func(5) == 0.2
</pre>
</div>

<pre class="example">
True

</pre>



<p>
This next test will raise an Exception, and we just run it to make sure it does.
</p>

<div class="org-src-container">
<pre class="src src-ipython" id="org560fcaf">func(0)
</pre>
</div>

<pre class="example">

ZeroDivisionErrorTraceback (most recent call last)
&lt;ipython-input-6-ba0cd5a88f0a&gt; in &lt;module&gt;()
----&gt; 1 func(0)

&lt;ipython-input-1-eafd354a3163&gt; in func(a)
     18     Returns: 1 / a.
     19     """
---&gt; 20     return 1 / a

ZeroDivisionError: division by zero

</pre>



<p>
This is just a doctest with indentation to show how it is used.
</p>

<div class="org-src-container">
<pre class="src src-ipython" id="org968debf"><span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(1, 4):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(func(i))
</pre>
</div>

<pre class="example">
1.0
0.5
0.3333333333333333


</pre>



<p>
That concludes the examples I want incorporated into the doctests. Each one of these blocks has a name, which is used as an argument to the noweb references in the function docstring.
</p>

<div id="outline-container-org91f890f" class="outline-2">
<h2 id="org91f890f"><span class="section-number-2">1</span> Add a way to run the tests</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a common idiom to enable easy running of the doctests. This will get tangled out to the file.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">if</span> <span style="color: #006FE0;">__name__</span> == <span style="color: #008000;">"__main__"</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">import</span> doctest
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   doctest.testmod()
</pre>
</div>
</div>
</div>


<div id="outline-container-org4759a84" class="outline-2">
<h2 id="org4759a84"><span class="section-number-2">2</span> Tangle the file</h2>
<div class="outline-text-2" id="text-2">
<p>
So far, the Python code we have written only exists in the org-file, and in memory. Tangling is the extraction of the code into a code file.
</p>

<p>
We run this command, which extracts the code blocks marked for tangling, and expands the noweb references in them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-tangle)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">test.py</td>
</tr>
</tbody>
</table>

<p>
Here is what we get:
</p>

<pre class="example">
def func(a):
    """A function to divide one by a.

    &gt;&gt;&gt; func(5) == 0.2
    True

    &gt;&gt;&gt; func(0)
    Traceback (most recent call last):
    ZeroDivisionError: division by zero

    &gt;&gt;&gt; for i in range(1, 4):
    ...     print(func(i))
    1.0
    0.5
    0.3333333333333333


    Returns: 1 / a.
    """
    return 1 / a

if __name__ == "__main__":
    import doctest
    doctest.testmod()

</pre>

<p>
That looks like a reasonable python file. You can see the doctest blocks have been inserted into the docstring, as desired. The proof of course is that we can run these doctests, and use the python module. We show that next.
</p>
</div>
</div>


<div id="outline-container-org8727607" class="outline-2">
<h2 id="org8727607"><span class="section-number-2">3</span> Run the tests</h2>
<div class="outline-text-2" id="text-3">
<p>
Now, we can check if the tests pass in a fresh run (i.e. not using the version stored in the jupyter kernel.) The standard way to run the doctests is like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">python test.py -v
</pre>
</div>




<p>
Well, that's it! It worked fine. Now we have a python file we can import and reuse, with some doctests that show how it works. For example, here it is in a small Python script.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> test <span style="color: #0000FF;">import</span> func
<span style="color: #0000FF;">print</span>(func(3))
</pre>
</div>

<pre class="example">
0.3333333333333333

</pre>



<p>
There are surely some caveats to keep in mind here. This was just a simple proof of concept idea that isn't tested beyond this example. I don't know how many complexities would arise from more complex doctests. But, it seems like a good idea to continue pursuing if you like using doctests, and like using org-mode and interactive/literate programming techniques.
</p>

<p>
It is definitely an interesting way to use noweb to build up better code files in my opinion.
</p>
</div>
</div>

<div id="outline-container-org5a82a2f" class="outline-2">
<h2 id="org5a82a2f"><a id="ID-D4437A03-A9D0-4B6D-B254-5F03CFB25F95"></a><span class="section-number-2">4</span> The noweb doctest block</h2>
<div class="outline-text-2" id="text-4">
<p>
These blocks are used in the noweb expansions. Each block takes a variable which is the name of a block. This block grabs the body of the named src block and formats it as if it was in a REPL.
</p>

<p>
We also grab the results of the named block and format it for the doctest. We use a heuristic to detect Tracebacks and modify the output to be consistent with it. In that case we assume the relevant Traceback is on the last line.
</p>

<p>
Admittedly, this does some fragile feeling things, like trimming whitespace here and there to remove blank lines, and quoting quotes (which was not actually used in this example), and removing the ": " pieces of ob-ipython results. Probably other ways of running the src-blocks would not be that suitable for this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org52486c2">(org-babel-goto-named-src-block name)
(<span style="color: #0000FF;">let*</span> ((src (s-trim-right (org-element-property <span style="color: #006FE0;">:value</span> (org-element-context))))
       (src-lines (split-string src <span style="color: #008000;">"\n"</span>))
       body result)
  (<span style="color: #0000FF;">setq</span> body
        (s-trim-right
         (s-concat <span style="color: #008000;">"&gt;&gt;&gt; "</span> (car src-lines) <span style="color: #008000;">"\n"</span>
                   (s-join <span style="color: #008000;">"\n"</span> (mapcar (<span style="color: #0000FF;">lambda</span> (s)
                                          (concat <span style="color: #008000;">"... "</span> s))
                                        (cdr src-lines))))))
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">now the results</span>
  (org-babel-goto-named-result name)
  (<span style="color: #0000FF;">let</span> ((result (org-element-context)))
    (<span style="color: #0000FF;">setq</span> result
          (<span style="color: #0000FF;">thread-last</span>
              (buffer-substring (org-element-property <span style="color: #006FE0;">:contents-begin</span> result)
                                (org-element-property <span style="color: #006FE0;">:contents-end</span> result))
            (s-trim)
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">remove ": " from beginning of lines</span>
            (replace-regexp-in-string <span style="color: #008000;">"^: *"</span> <span style="color: #008000;">""</span>)
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">quote quotes</span>
            (replace-regexp-in-string <span style="color: #008000;">"\\\""</span> <span style="color: #008000;">"\\\\\""</span>)))
    (<span style="color: #0000FF;">when</span> (string-match <span style="color: #008000;">"Traceback"</span> result)
      (<span style="color: #0000FF;">setq</span> result (format
                    <span style="color: #008000;">"Traceback (most recent call last):\n%s"</span>
                    (car (last (split-string result <span style="color: #008000;">"\n"</span>))))))
    (concat body <span style="color: #008000;">"\n"</span> result)))
</pre>
</div>
</div>
</div>
<p>Copyright (C) 2018 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2018/05/17/Literate-programming-with-python-doctests.org">org-mode source</a></p>
<p>Org-mode version = 9.1.13</p>